# 세개 이상의 모집단에 대한 가설검정
# 분산분석
# 분산분석이라는 용어는 분산이 발생한 과정을 분석하여 요인에 의한 분산과
# 요인을 통해 나누어진 각 집단 내의 분산으로 나누고 요인에 의한 분산이 
# 의미 있는 크기를 가지는지를 검정하는 것
# 세집단 이상의 평균비교에서는 독립인 두 집단의 평균 비교를 반복하여
# 실시할 경우에 제 1종오류가 증가하게 되어 문제 발생
# 이를 해결하기 위해 fisher가 개발한 분산분석을 이용
# 분산이 발생한 과정을 분석하여 요인에 의한 분산과 요인을 통해 나눠진 각집단 내의 분산으로 나누고
# 요인에 의한 분산이 의미있는 크기를 가지는지를 검정
# f값 = 집단간분산 / 집단내분산

# 서로 독립인 세 집단의 평균 차이 검정
# 일원분산분석
# 실습 : 세 가지 교육방법을 적용하여 1 개월동안 교육받은 교육생 80명을
# 대상으로 실기시험을 실시 
# 독립변수(범주형) : 한개의 요인 : 교육방법 방법의 종류가 3가지
# 종속변수(연속형) : 실기시험 평균 점수